//Задано 3 числа (a, b, c), які не рівні між собою.
//     Визначити середнє мід цими трьома числами
//     (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
//     Використати вкладені оператори if
//     Результат виводити в консоль.

let a = -10;
let b = -2.7;
let c = 12;

if(a>b && a<c || a>c && a<b){
    console.log(`${a} середнє число`);
} else if(b>a && b<c || b>c && b<a){
    console.log(`${b} середнє число`);
} else if(c>a && c<b || c>a && c<b){
    console.log(`${c} середнє число`);
}else {
    console.log("Числа мають бути різні");
}
